"use strict"

var a = 5, b = 3;

//1. (a>b) && (a===b)
console.log((a > b) && (a === b)); 

//2.true && 0 && (‘a’ < ‘Z’)
console.log(true && 0 && ("a" < "Z"));// правий аргумент true, тому обчислюємо і повертаємо правий аргумент (0)
console.log(0 && false); // тепер лівий аргумент 0, тобто false, тому оператор повертає його (0) і завершує обчислення

//3. (a>b) || true || (‘2’==2) || (false == ‘’)
console.log((a > b) || true || ("2"==2) || (false == ""));

//4. (a<b) && (0 == false)
console.log((a < b) && (0 == false));

//4. !(2==2) || (true && ‘’)
console.log(!(2==2) || (true && "")); // лівий аргумент true, тому обчислили і повернули правий аргумент - ""

